constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water oil);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 0.00005;
    rho             [1 -3 0 0 0 0 0] 100;
}

oil
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 0.001714285714;
    rho             [1 -3 0 0 0 0 0] 87.5;
}

sigma           [1 0 -2 0 0 0 0] 0.015;


// ************************************************************************* //
