0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type                fixedValue;
        value  uniform		(5.0e-3 0 0);
    }

    outlet
    {
        type            zeroGradient;

    }

    frontAndBack
    {
        type            noSlip;
    }

    lowerWall
    {
        type            noSlip;
    }
    
    upperWall
    {
        type            noSlip;
    }

}


// ************************************************************************* //
